zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/Drivers/led_pwm_control - 複製.c

/********************************************************************************
* include file				        											*
********************************************************************************/
#include "stm8s.h"
#include "Devices.h"
//#include "lev_device_define.h"

/********************************************************************************
* extern include file															*
********************************************************************************/
#include "Module_Driver_Define.h"


/********************************************************************************
* Define             															*
********************************************************************************/
#define _Frequency_Prescaler_               9999    // TIM1 frequency = fMaster / (999 + 1) = 4MHz / 1000 = 4KHz
#define _Init_Duty_                         0    // Duty = 2000 / Frequency_Prescaler = 2000 / 10000 = 0.2 (20%)
#define _One_Step_Frequency_Prescaler_      (unsigned int)((_Frequency_Prescaler_ + 1)/10)
#define _TIM1_Frequency_Prescaler_          _Frequency_Prescaler_    // TIM1 frequency = fMaster / (9999 + 1) = 4MHz / 10000 = 400Hz
#define _TIM2_Frequency_Prescaler_          _Frequency_Prescaler_    // TIM1 frequency = fMaster / (9999 + 1) = 4MHz / 10000 = 400Hz
/********************************************************************************
* tim1_init																		*
********************************************************************************/
void tim1_PWM_init(void)
{
	TIM1_DeInit();
	/* Time Base configuration */
	/*
	TIM1_Period = 4095
	TIM1_Prescaler = 0
	TIM1_CounterMode = TIM1_COUNTERMODE_UP
	TIM1_RepetitionCounter = 0
	*/
	TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, _TIM1_Frequency_Prescaler_, 0);
	/* Channel 1, 2,3 and 4 Configuration in PWM mode */
	/*
	TIM1_OCMode = TIM1_OCMODE_PWM2
	TIM1_OutputState = TIM1_OUTPUTSTATE_ENABLE
	TIM1_OutputNState = TIM1_OUTPUTNSTATE_ENABLE
	TIM1_Pulse = CCR1_Val
	TIM1_OCPolarity = TIM1_OCPOLARITY_LOW
	TIM1_OCNPolarity = TIM1_OCNPOLARITY_HIGH
	TIM1_OCIdleState = TIM1_OCIDLESTATE_SET
	TIM1_OCNIdleState = TIM1_OCIDLESTATE_RESET
	*/
	/*TIM1_Pulse = CCR1_Val*/
	TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
				 _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
				 TIM1_OCNIDLESTATE_RESET); 
	/*TIM1_Pulse = CCR2_Val*/
	TIM1_OC2Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
				 _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
				 TIM1_OCNIDLESTATE_RESET);
	/*TIM1_Pulse = CCR3_Val*/
	TIM1_OC3Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
				 _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
				 TIM1_OCNIDLESTATE_RESET);
	/*TIM1_Pulse = CCR4_Val*/
	TIM1_OC4Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, _Init_Duty_, TIM1_OCPOLARITY_HIGH,
				 TIM1_OCIDLESTATE_SET);
	/* TIM1 counter enable */
	TIM1_Cmd(ENABLE);
	/* TIM1 Main Output Enable */
	TIM1_CtrlPWMOutputs(ENABLE);

	return;
}

/********************************************************************************
* tim2_init																		*
********************************************************************************/
void tim2_PWM_init(void)
{
	TIM2_DeInit();
	/* Time base configuration */
	TIM2_TimeBaseInit(TIM2_PRESCALER_1, _TIM2_Frequency_Prescaler_); 
	/* PWM1 Mode configuration: Channel1 */ 
	TIM2_OC1Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, _Init_Duty_, TIM2_OCPOLARITY_HIGH); // Duty = 500 / prescaler = 500 / 1000 = 0.5 (50%)
	TIM2_OC1PreloadConfig(ENABLE);
	TIM2_ARRPreloadConfig(ENABLE);
	TIM2_Cmd(ENABLE);

	return;
}

/********************************************************************************
* LED I/O Control_init															*
********************************************************************************/

/********************************************************************************
* LED I/O Control_init															*
********************************************************************************/
void _Device_Init_Led_Function(void)
{
//    tim1_PWM_init();
//    tim2_PWM_init();
//    TIM1_CtrlPWMOutputs(DISABLE);
//    TIM1_Cmd(DISABLE);
//    TIM2_Cmd(DISABLE);
    
        TIM1_DeInit();
        TIM2_DeInit();

        
        /* Time base configuration */
        TIM2_TimeBaseInit(TIM2_PRESCALER_1, _TIM2_Frequency_Prescaler_); 
        /* PWM1 Mode configuration: Channel1 */ 
        TIM2_OC1Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 5000, TIM2_OCPOLARITY_HIGH); // Duty = 500 / prescaler = 500 / 1000 = 0.5 (50%)
        TIM2_OC1PreloadConfig(ENABLE);
        TIM2_ARRPreloadConfig(ENABLE);
        TIM2_Cmd(ENABLE);
        
        
        TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                     5000, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                     TIM1_OCNIDLESTATE_RESET);
        TIM1_OC4Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, 5000, TIM1_OCPOLARITY_LOW, TIM1_OCIDLESTATE_SET); 
        TIM1_CtrlPWMOutputs(ENABLE);
        TIM1_Cmd(ENABLE);
        //delay 1 sec
        for(int i = 0; i < 1000;i++){
          delay_cycles(100); //about 960us at 4MHz
        }
        TIM2_OC1Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 5000, TIM2_OCPOLARITY_HIGH); // Duty = 500 / prescaler = 500 / 1000 = 0.5 (50%)
        TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                     3000, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                     TIM1_OCNIDLESTATE_RESET);
        TIM1_OC4Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, 3000, TIM1_OCPOLARITY_LOW, TIM1_OCIDLESTATE_SET); 
        //delay 1 sec
        for(int i = 0; i < 1000;i++){
          delay_cycles(100); //about 960us at 4MHz
        }
        TIM2_OC1Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 5000, TIM2_OCPOLARITY_HIGH); // Duty = 500 / prescaler = 500 / 1000 = 0.5 (50%)
        TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                     1000, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                     TIM1_OCNIDLESTATE_RESET);
        TIM1_OC4Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, 1000, TIM1_OCPOLARITY_LOW, TIM1_OCIDLESTATE_SET); 
        //delay 1 sec
        for(int i = 0; i < 1000;i++){
          delay_cycles(100); //about 960us at 4MHz
        }
        TIM2_OC1Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 5000, TIM2_OCPOLARITY_HIGH); // Duty = 500 / prescaler = 500 / 1000 = 0.5 (50%)
        TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                     0, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                     TIM1_OCNIDLESTATE_RESET);
        TIM1_OC4Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, 0, TIM1_OCPOLARITY_LOW, TIM1_OCIDLESTATE_SET); 
        TIM2_Cmd(DISABLE);
        TIM1_CtrlPWMOutputs(DISABLE);
        TIM1_Cmd(DISABLE);
        //delay 1 sec
        for(int i = 0; i < 1000;i++){
          delay_cycles(100); //about 960us at 4MHz
        }
        //delay 1 sec
        for(int i = 0; i < 1000;i++){
          delay_cycles(100); //about 960us at 4MHz
        }
        TIM1_DeInit();
        TIM2_DeInit();


    
//	GPIO_Init(LED1_PORT, LED1_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//	GPIO_Init(LED2_PORT, LED2_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//	GPIO_Init(LED3_PORT, LED3_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//	GPIO_Init(LED4_PORT, LED4_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//	GPIO_Init(LED5_PORT, LED5_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
}

void _Device_Set_Led_PWM_BITs(unsigned char LEDNumBits){
    if(LEDNumBits != 0){
        TIM1_DeInit();
        TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, _TIM1_Frequency_Prescaler_, 0);
        // turn on , set high
        if(LEDNumBits & LED1){
            /*TIM1_Pulse = CCR1_Val*/
//            TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
//                         _Init_Duty_, TIM1_OCPOLARITY_LOW, TIM1_OCNPOLARITY_HIGH, TIM1_OCIDLESTATE_SET,
//                         TIM1_OCNIDLESTATE_RESET); 
            TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                         _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                         TIM1_OCNIDLESTATE_RESET);
        }
        if(LEDNumBits & LED2){
            /*TIM1_Pulse = CCR2_Val*/
            TIM1_OC2Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                         _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                         TIM1_OCNIDLESTATE_RESET);
        }
        if(LEDNumBits & LED3){
            /*TIM1_Pulse = CCR3_Val*/
            TIM1_OC3Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                         _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
                         TIM1_OCNIDLESTATE_RESET);
        }
        if(LEDNumBits & LED4){
            /*TIM1_Pulse = CCR4_Val*/
//            TIM1_OC4Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, _Init_Duty_, TIM1_OCPOLARITY_HIGH,
//                         TIM1_OCIDLESTATE_SET);
            //Yosun
            TIM1_OC4Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, _Init_Duty_, TIM1_OCPOLARITY_LOW, TIM1_OCIDLESTATE_SET); 
        }
        if(LEDNumBits & LED5){
            tim2_PWM_init();
        }
        /* TIM1 Main Output Enable */
        TIM1_CtrlPWMOutputs(ENABLE);
        
        //TIM1_BDTRConfig(TIM1_OSSISTATE_ENABLE, TIM1_LOCKLEVEL_OFF, 11, TIM1_BREAK_DISABLE, TIM1_BREAKPOLARITY_LOW, TIM1_AUTOMATICOUTPUT_ENABLE);        
        /* TIM1 counter enable */
        TIM1_Cmd(ENABLE);
        
    }else{
        // turn off , set low
            TIM1_OC4Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, 0, TIM1_OCPOLARITY_LOW, TIM1_OCIDLESTATE_SET); 
  //delay 1 sec
  for(int i = 0; i < 1000;i++){
      delay_cycles(100); //about 960us at 4MHz
  }
            
	GPIO_Init(LED1_PORT, LED1_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
	GPIO_Init(LED2_PORT, LED2_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
	GPIO_Init(LED3_PORT, LED3_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
	GPIO_Init(LED4_PORT, LED4_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
        TIM1_CtrlPWMOutputs(DISABLE);
        TIM1_Cmd(DISABLE);
        //TIM1_DeInit();
        
        TIM2_Cmd(DISABLE);
        //TIM2->CCMR1 = (uint8_t)((uint8_t)(TIM2->CCMR1 & (uint8_t)(~TIM2_CCMR_OCM))
//        TIM2->CCMR1 = (uint8_t)(~TIM2_CCMR_OCM);
//        TIM2_OC1PreloadConfig(DISABLE);
//        TIM2_ARRPreloadConfig(DISABLE);
	    GPIO_Init(LED5_PORT, LED5_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
        TIM2_DeInit();
    }    
}
void _Device_Set_Led_PWM_20_Steps(unsigned char steps){
    
    unsigned int scaler;
    if( steps >= 20){
        
        scaler = 0;
        
        
        /* Set the Pulse value */
        TIM1->CCR1H = (uint8_t)(scaler >> 8);
        TIM1->CCR1L = (uint8_t)(scaler);
        /* Set the Pulse value */
        TIM1->CCR2H = (uint8_t)(scaler >> 8);
        TIM1->CCR2L = (uint8_t)(scaler);
        /* Set the Pulse value */
        TIM1->CCR3H = (uint8_t)(scaler >> 8);
        TIM1->CCR3L = (uint8_t)(scaler);
        /* Set the Pulse value */
        TIM1->CCR4H = (uint8_t)(scaler >> 8);
        TIM1->CCR4L = (uint8_t)(scaler);
        /* Set the Pulse value */
        TIM2->CCR1H = (uint8_t)(scaler >> 8);
        TIM2->CCR1L = (uint8_t)(scaler);
        
//        TIM2_Cmd(DISABLE);
//	    GPIO_Init(LED5_PORT, LED5_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//        //TIM2_DeInit();
//
//        //TIM1_CtrlPWMOutputs(DISABLE);
//        TIM1_Cmd(DISABLE);
//        GPIO_Init(LED1_PORT, LED1_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//        GPIO_Init(LED2_PORT, LED2_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//        GPIO_Init(LED3_PORT, LED3_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//        GPIO_Init(LED4_PORT, LED4_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level


        
//    /* Reset the Output Compare Bits  & Set the Ouput Compare Mode */
//        TIM2->CCMR1 &= ~TIM2_CCMR_OCM;
//        TIM2->CCMR1 |= TIM2_CCMR_OCM & 0x20;
//    TIM2->CCMR1 = (uint8_t)((uint8_t)(TIM2->CCMR1 & (uint8_t)(~TIM2_CCMR_OCM)) |
//                            (uint8_t)TIM2_OCMode);
        
//        TIM2_Cmd(DISABLE);
//	GPIO_Init(LED5_PORT, LED5_PIN, GPIO_MODE_OUT_PP_LOW_FAST);  // set as output and PP Low level
//        TIM2_DeInit();
        

        return;
    }
    
    
    if( steps > 10){
        steps = 10 - (steps - 10);
    }
    if(steps <= 0){
        scaler = 0;
    }else{
        scaler =( _One_Step_Frequency_Prescaler_ * steps ) - 1;
    }


    
    /* Set the Pulse value */
    TIM1->CCR1H = (uint8_t)(scaler >> 8);
    TIM1->CCR1L = (uint8_t)(scaler);
    /* Set the Pulse value */
    TIM1->CCR2H = (uint8_t)(scaler >> 8);
    TIM1->CCR2L = (uint8_t)(scaler);
    /* Set the Pulse value */
    TIM1->CCR3H = (uint8_t)(scaler >> 8);
    TIM1->CCR3L = (uint8_t)(scaler);
    /* Set the Pulse value */
    TIM1->CCR4H = (uint8_t)(scaler >> 8);
    TIM1->CCR4L = (uint8_t)(scaler);
    /* Set the Pulse value */
    TIM2->CCR1H = (uint8_t)(scaler >> 8);
    TIM2->CCR1L = (uint8_t)(scaler);
    
}



void _Device_Set_Led_OnOff_BITs(unsigned char LEDNumBits)
{
        // turn on , set high
        // turn off , set low
        if(LEDNumBits & LED1){
            GPIO_WriteHigh(LED1_PORT, LED1_PIN);
        }else{
            GPIO_WriteLow(LED1_PORT, LED1_PIN);
        }
        if(LEDNumBits & LED2){
            GPIO_WriteHigh(LED2_PORT, LED2_PIN);
        }else{
            GPIO_WriteLow(LED2_PORT, LED2_PIN);
        }
        if(LEDNumBits & LED3){
            GPIO_WriteHigh(LED3_PORT, LED3_PIN);
        }else{
            GPIO_WriteLow(LED3_PORT, LED3_PIN);
        }
        if(LEDNumBits & LED4){
            GPIO_WriteHigh(LED4_PORT, LED4_PIN);
        }else{
            GPIO_WriteLow(LED4_PORT, LED4_PIN);
        }
        if(LEDNumBits & LED5){
            GPIO_WriteHigh(LED5_PORT, LED5_PIN);
        }else{
            GPIO_WriteLow(LED5_PORT, LED5_PIN);
        }
}
//void _Device_Set_Led_PWM_Function(unsigned char LEDNumBits, unsigned char enable){
//	TIM1_DeInit();
//    if(enable){
//        TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, _TIM1_Frequency_Prescaler_, 0);
//        // turn on , set high
//        if(LEDNumBits & LED1){
//            /*TIM1_Pulse = CCR1_Val*/
//            TIM1_OC1Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
//                         _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
//                         TIM1_OCNIDLESTATE_RESET); 
//        }
//        if(LEDNumBits & LED2){
//            /*TIM1_Pulse = CCR2_Val*/
//            TIM1_OC2Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
//                         _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
//                         TIM1_OCNIDLESTATE_RESET);
//        }
//        if(LEDNumBits & LED3){
//            /*TIM1_Pulse = CCR3_Val*/
//            TIM1_OC3Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
//                         _Init_Duty_, TIM1_OCPOLARITY_HIGH, TIM1_OCNPOLARITY_LOW, TIM1_OCIDLESTATE_SET,
//                         TIM1_OCNIDLESTATE_RESET);
//        }
//        if(LEDNumBits & LED4){
//            /*TIM1_Pulse = CCR4_Val*/
//            TIM1_OC4Init(TIM1_OCMODE_PWM1, TIM1_OUTPUTSTATE_ENABLE, _Init_Duty_, TIM1_OCPOLARITY_HIGH,
//                         TIM1_OCIDLESTATE_SET);
//        }
//        if(LEDNumBits & LED5){
//            tim2_PWM_init();
//        }
//        /* TIM1 counter enable */
//        TIM1_Cmd(ENABLE);
//        /* TIM1 Main Output Enable */
//        TIM1_CtrlPWMOutputs(ENABLE);
//        
//    }else{
//        // turn off , set low
//        TIM1_CtrlPWMOutputs(DISABLE);
//        TIM1_Cmd(DISABLE);
//        TIM2_Cmd(DISABLE);
//        TIM1_DeInit();
//        TIM2_DeInit();
//    }    
//}
//void _Device_Set_Led_OnOff_org(unsigned char LEDNumBits, unsigned char enable)
//{
//    if(enable){
//        // turn on , set high
//        if(LEDNumBits & LED1){
//            GPIO_WriteHigh(LED1_PORT, LED1_PIN);
//        }
//        if(LEDNumBits & LED2){
//            GPIO_WriteHigh(LED2_PORT, LED2_PIN);
//        }
//        if(LEDNumBits & LED3){
//            GPIO_WriteHigh(LED3_PORT, LED3_PIN);
//        }
//        if(LEDNumBits & LED4){
//            GPIO_WriteHigh(LED4_PORT, LED4_PIN);
//        }
//        if(LEDNumBits & LED5){
//            GPIO_WriteHigh(LED5_PORT, LED5_PIN);
//        }
//    }else{
//        // turn off , set low
//        if(LEDNumBits & LED1){
//            GPIO_WriteLow(LED1_PORT, LED1_PIN);
//        }
//        if(LEDNumBits & LED2){
//            GPIO_WriteLow(LED2_PORT, LED2_PIN);
//        }
//        if(LEDNumBits & LED3){
//            GPIO_WriteLow(LED3_PORT, LED3_PIN);
//        }
//        if(LEDNumBits & LED4){
//            GPIO_WriteLow(LED4_PORT, LED4_PIN);
//        }
//        if(LEDNumBits & LED5){
//            GPIO_WriteLow(LED5_PORT, LED5_PIN);
//        }
//        
//    }
//    
//}

